openfoam_tbnn_low_25/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Which of the steps to run
castellatedMesh true;
snap            true;
addLayers       false;


geometry
{
   ahmed_25deg_m.stl
    {
        type triSurfaceMesh;
        name ahmed_body;
    }

    refinementBox_1
    {
        type searchableBox;
        min (-1.0 -0.7 0.0);
        max ( 5.0  0.7 1);
    }
    
    refinementBox_2
    {
        type searchableBox;
        min (-0.7 -0.6 0.0);
        max ( 4.0  0.6 1);
    }
    
    refinementBox_3
    {
        type searchableBox;
        min (-0.5 -0.5 0.0);
        max ( 1.5 0.5 0.6);
    }
};



// Settings for the castellatedMesh generation.
castellatedMeshControls
{

    // Refinement parameters
    maxLocalCells 5000000;
    maxGlobalCells 30000000;
    minRefinementCells 10;
    maxLoadUnbalance 0.10;
    nCellsBetweenLevels 3;

    // Explicit feature edge refinement
    features
    (
      {
            file "ahmed_25deg_m.eMesh";
            level 8;
        }
    );

	// Surface based refinement
    refinementSurfaces
    {
        ahmed_body
        {
            level (4 5);
            patchInfo
            {
                type wall;
                inGroups (ahmed_bodyGroup);
            }
        }
    }

	// Region-wise refinement
    refinementRegions
    {
		ahmed_body
		{
			mode distance;
			levels ((0.025 7) (0.1 6));
		}

        refinementBox_1
        {
            mode inside;
            levels ((1E15 3));
        }
        
        refinementBox_2
        {
            mode inside;
            levels ((1E15 4));
        }
        
        refinementBox_3
        {
            mode inside;
            levels ((1E15 5));
        }
    }
    
    resolveFeatureAngle 30;
    locationInMesh (0.9441  0.1945 0.245);
    allowFreeStandingZoneFaces true;
}



// Settings for the snapping.
snapControls
{
    nSmoothPatch 3;
    tolerance 2.0;
    nSolveIter 30;
    nRelaxIter 5;
    nFeatureSnapIter 10;
    implicitFeatureSnap false;
    explicitFeatureSnap true;
    multiRegionFeatureSnap false;
}


// Settings for the layer addition.
addLayersControls
{
    layers
    {
        lowerWall
        {
            nSurfaceLayers 5;
        }
        
        ahmed_body
        {
            nSurfaceLayers 6;
        }
    }
    
    relativeSizes false;
    expansionRatio 1;
    firstLayerThickness 0.0006;
    minThickness 0.0006;
    nGrow 0;
    featureAngle 30;
    slipFeatureAngle 30;
    nRelaxIter 3;
    nSmoothSurfaceNormals 1;
    nSmoothNormals 3;
    nSmoothThickness 10;
    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;
    minMedianAxisAngle 90;
    nBufferCellsNoExtrude 0;
    nLayerIter 50;
}

// Generic mesh quality settings. At any undoable phase these determine
// where to undo.
meshQualityControls
{
    #include "meshQualityDict"
}


// Advanced

// Write flags
writeFlags
(
    scalarLevels
    layerSets
    layerFields     // write volScalarField for layer coverage
);


// Merge tolerance. Is fraction of overall bounding box of initial mesh.
// Note: the write tolerance needs to be higher than this.
mergeTolerance 1e-6;


// ************************************************************************* //
