openfoam_tbnn_low_25/system/streamLines
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

streamLines
{
    // Where to load it from
    libs            ("libfieldFunctionObjects.so");

    type            streamLine;

    // Output every
    writeControl    writeTime;
    // writeInterval 10;

    setFormat       vtk; // gnuplot; // xmgr; //raw; //jplot; //csv; //ensight;

    // Track forward (+U) or backward (-U) or both
    direction       forward;

    // Names of fields to sample. Should contain above velocity field!
    fields (p U k);

    // Steps particles can travel before being removed
    lifeTime        10000;

    //- Specify either absolute length of steps (trackLength) or a number
    //  of subcycling steps per cell (nSubCycle)

        // Size of single track segment [m]
        // trackLength 1e-3;

        // Number of steps per cell (estimate). Set to 1 to disable subcycling.
        nSubCycle 5;


    // Cloud name to use
    cloudName       particleTracks;

    // Seeding method.
    seedSampleSet
    {
        type        lineUniform;
        axis        x;  // distance;

        // Note: tracks slightly offset so as not to be on a face
        start       (-1.001 -0.05 0.0011);
        end         (-1.001 -0.05 1.0011);
        nPoints     20;
    }
}


// ************************************************************************* //
